/*
 * Copyright (c) 2009 Sung Ho Park
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _HEAP_H_
#define _HEAP_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <ubinos/bsp.h>
#include <ubinos/bsp_ubik.h>
#include <ubinos/ubiclib.h>

#if !defined(UBINOS__UBICLIB__HEAP_DIR0_ALGORITHM)
    // maximum size = 256 KiB
    #define UBINOS__UBICLIB__HEAP_DIR0_ALGORITHM        UBINOS__UBICLIB__HEAP_ALGORITHM__GROUP
    #define UBINOS__UBICLIB__HEAP_DIR0_LOCKTYPE         UBINOS__UBICLIB__HEAP_LOCK_TYPE__MUTEX
    #define UBINOS__UBICLIB__HEAP_DIR0_M                (8)
    #define UBINOS__UBICLIB__HEAP_DIR0_FBLCOUNT         (226)
    #define UBINOS__UBICLIB__HEAP_DIR0_FBLBM_BUFSIZE    (36)
#endif

#if !defined(UBINOS__UBICLIB__HEAP_DIR1_ALGORITHM)
    #define UBINOS__UBICLIB__HEAP_DIR1_ALGORITHM        UBINOS__UBICLIB__HEAP_ALGORITHM__BESTFIT
    #define UBINOS__UBICLIB__HEAP_DIR1_LOCKTYPE         UBINOS__UBICLIB__HEAP_LOCK_TYPE__MUTEX
    #define UBINOS__UBICLIB__HEAP_DIR1_M                (2)
    #define UBINOS__UBICLIB__HEAP_DIR1_FBLCOUNT         (2)
    #define UBINOS__UBICLIB__HEAP_DIR1_FBLBM_BUFSIZE    (4)
#endif


#if !(UBINOS__UBICLIB__EXCLUDE_HEAP_LOGMD == 1)
    #define heap_logmd(msg) logmd(msg)
    #define heap_logmfd(format, args...) logmfd(format, ## args)
#else
    #define heap_logmd(msg)
    #define heap_logmfd(format, args...)
#endif /* !(UBINOS__UBICLIB__EXCLUDE_HEAP_LOGMD == 1) */



                logme("tag is wrong (error type 5)");                                                       \
                bsp_abortsystem();                                                                          \
            }                                                                                               \
            if ((m) <= _tag_to_g_r(tag)) {                                                                  \
                logme("tag is wrong (error type 6)");                                                       \
                bsp_abortsystem();                                                                          \
            }                                                                                               \
        }                                                                                                   \
    }
#else
    #define _tag_check(tag, dir, log2m, m, min)
#endif /* !(UBINOS__UBICLIB__EXCLUDE_HEAP_INTERMEDIATE_DATA_CHECK == 1) */


#define _kblr_to_tag(k, b, l, r, a, d) (                                                                    \
    (((unsigned int) (a    ) << HEAP_G_TAG__DGKLRB_BITSIZE ) & HEAP_G_TAG_A_______MASK) |                   \
    (((unsigned int) (d    ) << HEAP_G_TAG___GKLRB_BITSIZE ) & HEAP_G_TAG__D______MASK) |                   \
    (((unsigned int) (1    ) << HEAP_G_TAG____KLRB_BITSIZE ) & HEAP_G_TAG___G_____MASK) |                   \
    (((unsigned int) (k    ) << HEAP_G_TAG_____LRB_BITSIZE ) & HEAP_G_TAG____K____MASK) |                   \
    (((unsigned int) (l    ) << HEAP_G_TAG______RB_BITSIZE ) & HEAP_G_TAG_____L___MASK) |                   \
    (((unsigned int) (r    ) << HEAP_G_TAG_______B_BITSIZE ) & HEAP_G_TAG______R__MASK) |                   \
    (((unsigned int) (b    )                               ) & HEAP_G_TAG_______B_MASK)    )

#define _asize_to_tag_l(asize, a, d) (                                                                      \
    (((unsigned int) (a    ) << HEAP_G_TAG__DGKLRB_BITSIZE ) & HEAP_G_TAG_A_______MASK) |                   \
    (((unsigned int) (d    ) << HEAP_G_TAG___GKLRB_BITSIZE ) & HEAP_G_TAG__D______MASK) |                   \
    (((unsigned int) (asize) >> HEAP_L_BLOCK_ASIZE_OFFSET  ) & HEAP_L_TAG_ASIZE_MASK  )    )


#if (UBINOS__UBICLIB__HEAP_ALIGNMENT == INT_SIZE)

#elif (UBINOS__UBICLIB__HEAP_ALIGNMENT == 16)
    #if !(INT_SIZE == 4)
        #error "Unsupported UBINOS__UBICLIB__HEAP_ALIGNMENT and INT_SIZE"
    #endif /* !(INT_SIZE == 4) */
#else
    #error "Unspuuorted UBINOS__UBICLIB__HEAP_ALIGNMENT"
#endif /* (UBINOS__UBICLIB__HEAP_ALIGNMENT == ...) */

#if !(UBINOS__UBICLIB__EXCLUDE_HEAP_BOUNDARY_CHECK == 1)

    #define BOUNDARY_SIZE                    INT_SIZE

    typedef struct __attribute__((packed, aligned(1))) __heap_block_t {
        unsigned int    boundary;               // 4 (header boundary)
        unsigned int    tag;                    // 8
        struct {
            struct __heap_block_t *    prev;    // 12
            struct __heap_block_t *    next;    // 16
            edlist_pt                list;      // 20
        }                heap_blocklist_link;
        unsigned int    rsize;                  // 24
#if !(UBINOS__UBICLIB__EXCLUDE_HEAP_FLAG == 1)
        unsigned int    flags;                  // 28
    #if (UBINOS__UBICLIB__HEAP_ALIGNMENT == 16)
    #endif
#else
    #if (UBINOS__UBICLIB__HEAP_ALIGNMENT == 16)
        unsigned int    reserved1;              // 28
    #endif
#endif /* !(UBINOS__UBICLIB__EXCLUDE_HEAP_FLAG == 1) */
    } _heap_block_t;
                                                // 32 (top boundary)

    typedef _heap_block_t * _heap_block_pt;

    #define HEAP_BLOCK_HEADER_SIZE (sizeof(_heap_block_t))
    #define HEAP_BLOCK_OVERHEAD (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE + HEAP_TAG_SIZE + BOUNDARY_SIZE)

    #define _set_header_boundary(block)                                                                                                                 \
        (*((unsigned int *) ((unsigned int) (block)))                                                        = HEAP_BOUNDARY_PATTERN)
    #define _set_top_boundary(block)                                                                                                                    \
        (*((unsigned int *) ((unsigned int) (block) + HEAP_BLOCK_HEADER_SIZE))                                 = HEAP_BOUNDARY_PATTERN)
    #define _set_bottom_boundary(block, log2m)                                                                                                          \
        (*((unsigned int *) ((unsigned int) (block) + _tag_to_asize((block)->tag, log2m) - BOUNDARY_SIZE))    = HEAP_BOUNDARY_PATTERN)
    #define _set_boundary(block, log2m) {                                                                                                               \
        _set_header_boundary(block);                                                                                                                    \
        _set_top_boundary(block);                                                                                                                       \
        _set_bottom_boundary(block, log2m);                                                                                                             \
    }

    #define _check_header_boundary(block)                                                                                                               \
        ((HEAP_BOUNDARY_PATTERN == *((unsigned int *) ((unsigned int) (block))))                                                        ? 1 : 0)
    #define _check_top_boundary(block)                                                                                                                  \
        ((HEAP_BOUNDARY_PATTERN == *((unsigned int *) ((unsigned int) (block) + HEAP_BLOCK_HEADER_SIZE)))                               ? 1 : 0)
    #define _check_bottom_boundary(block, log2m)                                                                                                        \
        ((HEAP_BOUNDARY_PATTERN == *((unsigned int *) ((unsigned int) (block) + _tag_to_asize((block)->tag, log2m) - BOUNDARY_SIZE)))   ? 1 : 0)
    #define _check_boundary(block, log2m) (                                                                                                             \
        _check_header_boundary(block) &&                                                                                                                \
        _check_top_boundary(block) &&                                                                                                                   \
        _check_bottom_boundary(block, log2m)                                                                                                            \
    )

    #define _check_boundary_and_abort(block, log2m) {                                                                                                   \
        if         (!_check_header_boundary(block)) {                                                                                                   \
            logmfe("memory(0x%08x) is polluted (head boundary)",        (unsigned int) (block) + (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE));             \
            bsp_abortsystem();                                                                                                                          \
        }                                                                                                                                               \
        else if    (!_check_top_boundary(block)) {                                                                                                      \
            logmfe("memory(0x%08x) is polluted (top boundary)",         (unsigned int) (block) + (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE));             \
            bsp_abortsystem();                                                                                                                          \
        }                                                                                                                                               \
        else if    (!_check_bottom_boundary(block, log2m)) {                                                                                            \
            logmfe("memory(0x%08x) is polluted (bottom boundary)",      (unsigned int) (block) + (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE));             \
            bsp_abortsystem();                                                                                                                          \
        }                                                                                                                                               \
    }

    #define _check_freeable_and_abort(block) {                                                                                                          \
        if (_tag_to_a((block)->tag) != 0) {                                                                                                             \
            logmfe("memory(0x%08x) is not freeable (not allocated)",    (unsigned int) (block) + (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE));             \
            bsp_abortsystem();                                                                                                                          \
        }                                                                                                                                               \
    }

#else

    #define BOUNDARY_SIZE                    0

    typedef struct __attribute__((packed, aligned(1))) __heap_block_t {
        unsigned int    tag;                    // 4
        struct {
            struct __heap_block_t *    prev;    // 8
            struct __heap_block_t *    next;    // 12
            edlist_pt                list;      // 16
        }                heap_blocklist_link;
        unsigned int    rsize;                  // 20
#if !(UBINOS__UBICLIB__EXCLUDE_HEAP_FLAG == 1)
        unsigned int    flags;                  // 24
    #if (UBINOS__UBICLIB__HEAP_ALIGNMENT == 16)
        unsigned int    reserved1;              // 28
        unsigned int    reserved2;              // 32
    #endif
#else
    #if (UBINOS__UBICLIB__HEAP_ALIGNMENT == 16)
        unsigned int    reserved1;              // 24
        unsigned int    reserved2;              // 28
        unsigned int    reserved3;              // 32
    #endif
#endif /* !(UBINOS__UBICLIB__EXCLUDE_HEAP_FLAG == 1) */
    } _heap_block_t;


    typedef _heap_block_t * _heap_block_pt;

    #define HEAP_BLOCK_HEADER_SIZE (sizeof(_heap_block_t))
    #define HEAP_BLOCK_OVERHEAD (HEAP_BLOCK_HEADER_SIZE + BOUNDARY_SIZE + HEAP_TAG_SIZE + BOUNDARY_SIZE)

    #define _set_header_boundary(block)
    #define _set_top_boundary(block)
    #define _set_bottom_boundary(block, log2m)
    #define _set_boundary(block, log2m)

    #define _check_header_boundary(block) 1
    #define _check_top_boundary(block) 1
    #define _check_bottom_boundary(block, log2m) 1
    #define _check_boundary(block, log2m) 1

    #define _check_boundary_and_abort(block, log2m)
    #define _check_freeable_and_abort(block)

#endif /* !(UBINOS__UBICLIB__EXCLUDE_HEAP_BOUNDARY_CHECK == 1) */


